<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 驱动方式
    'type' => env('cache.type', 'File'),
    // 缓存保存目录
    'path' => '',
    // 缓存前缀
    'prefix' => env('cache.prefix', ''),
    // 缓存有效期 0表示永久缓存
    'expire' => env('cache.expire', 0),
    // 连接ip
    'host' => env('redis.host', '127.0.0.1'),
    // 连接端口
    'port' => env('redis.port', 6379),
    // 连接密匙
    'password' => env('redis.password', ''),
    // 数据库
    'select' => env('redis.select', 0)
];
